{
    "title": "The Lanterns of Evershade",
    "description": "Two travelers navigate a haunted forest, uncovering secrets that bind them together.",
    "story": [
        "The night pressed close around the narrow path, the trees leaning in as if to whisper secrets.",
        "Dulta clutched her cloak tighter, her breath fogging in the cold air, and glanced at Neralvi.",
        "Neralvi's eyes were steady, scanning the shadows for movement, yet his hand lingered near hers.",
        "\"Do you feel it?\" she whispered, though the wind swallowed her words almost immediately.",
        "A flicker of light appeared between the gnarled trunks ahead, like a distant lantern swaying.",
        "They moved toward it cautiously, each step crunching on frost-hardened leaves, hearts in rhythm.",
        "The lantern was not tied to any tree. It hovered midair, glowing softly, casting long, trembling shadows.",
        "Neralvi bent slightly, studying it. \"This is no ordinary light,\" he murmured, his voice low and tense.",
        "Dulta shivered, partly from the cold and partly from the unspoken truth in his tone.",
        "Suddenly, the lantern jerked upward as if pulled by an invisible hand, then drifted forward.",
        "\"We should follow,\" Neralvi said, more to himself than to her, but his hand brushed hers.",
        "A jolt of warmth ran through Dulta at the contact, and she tried to hide the quickening of her pulse.",
        "The path twisted unnaturally, curving where no path should exist, yet the lantern never faltered.",
        "Shadows shifted, forming shapes that almost resembled faces, and the forest seemed to breathe.",
        "\"Are we… being watched?\" Dulta asked, swallowing against the rising fear.",
        "Neralvi gave a small, grim nod, but kept his gaze on the light. \"Perhaps. But it's guiding us, too.\"",
        "They reached a clearing where the lantern hovered above a pool of still water, reflecting a sky they did not recognize.",
        "Dulta stepped closer, the air thick with the scent of moss and distant rain, feeling oddly drawn.",
        "\"Whatever this is,\" Neralvi said, \"we are part of it now.\"",
        "The lantern pulsed gently, and a ripple of color danced across the water, illuminating their faces.",
        "For a moment, words failed them, and the forest seemed to fall silent, holding its breath.",
        "Then a whisper floated through the clearing, soft yet certain, calling their names in unison.",
        "Dulta looked at Neralvi, and in that glance, they understood an unspoken truth: the journey was only beginning."
    ]
}